УТ.УчетЗадач/src/InformationRegisters/cbr_ОценкаЧасов/cbr_ОценкаЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ОценкаЧасов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>От</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>До</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Согласовант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОценки</name>
    <type>
      <types>EnumRef.cbr_ТипОценкиЧасов</types>
    </type>
  </resources>
  <attributes>
    <name>КомментарийОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_СобытияПоЗадачам/cbr_СобытияПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_СобытияПоЗадачам</name>
  <resources>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АвторСобытия</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_ОценкаЧасов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
Процедура СоздатьЗаписьСогласования(Задача, ТипОценки, Длительность, КомментарийОценки, Согласующий,	
	ЧасыОт = Неопределено, ЧасыДо = Неопределено) Экспорт
	НачатьТранзакцию();
	Попытка
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Задача = Задача;
		МенеджерЗаписи.ТипОценки = ТипОценки;
		Если ЧасыОт <> Неопределено Тогда
			МенеджерЗаписи.От = ЧасыОт;
		КонецЕсли;
		Если ЧасыДо <> Неопределено Тогда
			МенеджерЗаписи.До = ЧасыДо;
		КонецЕсли;
		МенеджерЗаписи.Длительность = Длительность;
		МенеджерЗаписи.КомментарийОценки = КомментарийОценки;
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Согласующий = Согласующий;
		МенеджерЗаписи.Согласовант = Пользователи.ТекущийПользователь();
		МенеджерЗаписи.Записать();
		
		МенеджерЗаписи = РегистрыСведений.cbr_СобытияПоЗадачам.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
		МенеджерЗаписи.АвторСобытия = Пользователи.АвторизованныйПользователь();
		МенеджерЗаписи.Задача = Задача;
		ЧасыОценки = "";
		Если ЧасыОт <> Неопределено И ЧасыДо <> Неопределено Тогда
			ЧасыОценки =  СтрШаблон(" оценка от %1 до %2 часов", ЧасыОт, ЧасыДо);
		ИначеЕсли ЧасыДо <> Неопределено Тогда
			ЧасыОценки = СтрШаблон(" оценка %1 часов", Строка(ЧасыДо));
		КонецЕсли;
		ДниОценки = СтрШаблон(", длительность %1 дней", Длительность);
		МенеджерЗаписи.Событие = СтрШаблон("Отправлена на согласование %1%2%3", ТипОценки, ЧасыОценки, ДниОценки);
		МенеджерЗаписи.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

Процедура ИзменитьПоследнююЗаписьПоЗадаче(Задача, Отказ, Согласовано, КомментарийОтказа = Неопределено) Экспорт
	НачатьТранзакцию();
	Попытка
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.Задача.Установить(Задача);
		Набор.Прочитать();
		Запись = Набор[Набор.Количество() - 1];
		Запись.Согласовано = Согласовано;
		Запись.Отказ = Отказ;
		Если КомментарийОтказа <> Неопределено Тогда
			Запись.КомментарийОтказа = КомментарийОтказа;
		КонецЕсли;
		Набор.Записать();
		
		МенеджерЗаписи = РегистрыСведений.cbr_СобытияПоЗадачам.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
		МенеджерЗаписи.АвторСобытия = Пользователи.АвторизованныйПользователь();
		МенеджерЗаписи.Задача = Задача;
		ТекстСобытия = "Оценка часов по задаче";
		Если Отказ Тогда
			ТекстСобытия = ТекстСобытия + " не согласована";
		Иначе
			ТекстСобытия = ТекстСобытия + " согласована";
		КонецЕсли;
		МенеджерЗаписи.Событие = ТекстСобытия;
		МенеджерЗаписи.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

Процедура ОтменитьНесогласованные(Задача, Согласующий) Экспорт
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Задача.Установить(Задача);
	Набор.Прочитать();
	
	Для Каждого Запись Из Набор Цикл
		Если Запись.Согласующий = Согласующий И Не Запись.Согласовано И Не Запись.Отказ Тогда
			Запись.Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Набор.Записать();
КонецПроцедуры
#КонецОбласти
#КонецЕсли
